In [1]:
import pandas as pd
import numpy as np

In [2]:
dict1={
    "name":['ayush','ayush'],
    "age":[12,23]
}

In [3]:
df=pd.DataFrame(dict1)

In [4]:
df

    name  age
0  ayush   12
1  ayush   23

In [7]:
df.to_csv('ayush.csv')

In [11]:
df.drop_duplicates(subset=['name'],keep='first')

    name  age
0  ayush   12